import 'package:flutter/material.dart';

class AboutCollege extends StatelessWidget {
  const AboutCollege({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text("حول الكلية"),
        centerTitle: true,
      ),
      body: ListView(
        children: const [
          Padding(
            padding: EdgeInsets.only(top: 15.0, left: 15, right: 15, bottom: 8),
            child: Text(
              'لمحة تاريخية',
              textAlign: TextAlign.center,
              style: TextStyle(fontSize: 24),
            ),
          ),
          SizedBox(
            height: 20,
          ),
          Padding(
            padding: const EdgeInsets.all(20.0),
            child: Text('''
أُنشئت كلية علوم الحاسب ونظم المعلومات بجامعة نجران في مطلع العام الجامعي 1427 هـ حيث شكل قسمي علوم الحاسب و نظم المعلومات النواة الأولى للكلية مقدمةً من خلالهما عدد من البرامج في مجال الحاسوب وتقنية المعلومات لصناعة السوق المحلية ولمواكبة التطورات التقنية وتحقيق متطلبات التعليم العالي في وطننا الغالي.

يعتبر مجال علوم الحاسب ونظم المعلومات أحد التخصصات الحديثة والمتجددة حيث صنف على أنه أحد أفرع العلوم الهامة لبناء المجتمعات الحديثة ذات الاقتصاديات القوية التي تضع الدولة في مصاف الدول المتقدمة صناعيا وتقنيا في القرن الواحد والعشرين. وھو من أكثر العلوم تجددا وأسرعها تغيرا بحيث يدفع المتخصصين ليكونوا على اطلاع واسع بالمعلومات التقنية التي تتغير على مدار الساعة.

إنطلاقاً من هذه المقدمة، تسعى كلية علوم الحاسب ونظم المعلومات بجامعة نجران على أن تكون كلية رائدة في المملكة العربية السعودية وذلك بمساهمتها الفاعلة في تقديم خريجين ذوي قدرات أكاديمية عالية في مجالات علوم الحاسب ونظم المعلومات المختلفة. حيث تعمل الكلية على تسليح خريجيها بالمعلومات الكافية والمناسبة التي تساعدهم في احتلال مواقع متميزة في المؤسسات ذات الصلة بالتخصص وتطوير أنفسهم لمواكبة التطور الذي يطرأ في المجال وكذلك في مجالات البحث العلمي. كما ان الكلية تعمل على ان تكون مصدرا للبحث العلمي المتميز والتي تدعم به أولويات المملكة من الناحية العلمية والصناعية والاقتصادية وكذلك رفع مستوى المجتمع التقني والفني فيما يخص مجال الحاسب الآلي.

تشمل كلية علوم الحاسب ونظم المعلومات قسمين أساسيين: قسم علوم الحاسب وقسم نظم المعلومات. وهنالك قسمين آخرين سوف يبدأ قبول الطلاب بهما قريبا بمشيئة الله.
'''),
          ),
        ],
      ),
    );
  }
}
